const questions = [
    {
        "question": "機器學習是以下哪個技術？",
        "options": ["系統分析的一個分支", "從數據中學習並根據經驗進行改進的技術", "遵循明確的代碼指令的技術", "面向大眾的科技應用"],
        "answer": "B"
    },
    {
        "question": "機器學習應用程序可以在以下哪些領域找到？",
        "options": ["教育和科學", "社交媒體和娛樂", "醫療保健和金融", "所有選項都是"],
        "answer": "D"
    },
    {
        "question": "目前機器學習的一些行業趨勢是以下哪些？",
        "options": ["企業加大對人工智能和機器學習的投入", "採用生成式 AI 技術創建新內容", "利用雲平台和服務來簡化和加速機器學習模型的開發和部署", "以上皆是"],
        "answer": "D"
    },
    {
        "question": "機器學習算法可以用於以下哪些目的？",
        "options": ["聊天機器人和娛樂", "營銷和廣告", "文本、圖像、音頻、視頻等內容的創建", "所有選項都是"],
        "answer": "D"
    },
    {
        "question": "在機器學習中，需要特別關注以下哪些問題？",
        "options": ["數據隱私和模型公平性", "開發和部署的速度和效率", "數據收集和分析的範圍和覆蓋率", "模型的複雜度和精確度"],
        "answer": "A"
    },
    {
        "question": "ETL 的三個主要步驟是什麼？",
        "options": ["提取、轉換、載入", "提取、轉換、存儲", "提取、格式化、載入", "提取、格式化、存儲"],
        "answer": "A"
    },
    {
        "question": "並行計算 (Parallel Computing) 是哪種計算架構的主流？",
        "options": ["單一計算架構", "過時計算架構", "分布式計算架構", "中央集中計算架構"],
        "answer": "C"
    },
    {
        "question": "下列哪個不是 MapReduce 計算框架的串流資料處理工具？",
        "options": ["Apache Spark", "Hadoop", "Google Cloud Dataflow", "Microsoft Excel"],
        "answer": "D"
    },
    {
        "question": "原始資料 (Raw Data) 主要有哪些問題？",
        "options": ["沒有空值、資料結構一致、資料有異常值", "資料結構不一致、資料有異常值、資料過期", "不完整、不一致的資料格式、資料源多樣", "完整、一致的資料格式、資料源單一"],
        "answer": "C"
    },
    {
        "question": "ETL 的哪個優勢使其不被程式語言所綁架？",
        "options": ["提供多種程式語言的 API", "支持單一程式語言", "僅支持物件導向程式語言", "僅支持函數式程式語言"],
        "answer": "A"
    },
    {
        "question": "在 ETL 過程中，哪個階段負責處理原始資料的不完整性？",
        "options": ["Transformation", "Extraction", "Loading", "沒有特定階段"],
        "answer": "A"
    },
    {
        "question": "MapReduce 中的並行計算是什麼意思?",
        "options": ["將資料分為多個部分", "將任務交由各個中央處理器進行多任務的計算模式", "進行單一任務的計算模式", "將資料重新整理成一個部分"],
        "answer": "B"
    },
    {
        "question": "特徵工程的主要目的是什麼?",
        "options": ["將原始資料轉化為更能表達問題特徵的技術", "僅僅使用一種方式進行特徵選取", "將資料分成多個子任務", "將資料合併成一個大任務"],
        "answer": "A"
    },
    {
        "question": "特徵工程對機器學習有哪些好處?",
        "options": ["增加計算速度", "減少訓練時間", "提高預測精準度", "以上皆是"],
        "answer": "D"
    },
    {
        "question": "特徵選取的策略如何影響機器學習模型?",
        "options": ["僅影響訓練時間", "僅影響訓練效率", "影響模型的訓練成果", "不影響機器學習模型"],
        "answer": "C"
    },
    {
        "question": "資料正規化的主要目的是什麼?",
        "options": ["將資料轉換為更易於處理的格式", "將資料轉換到特定範圍的過程", "僅僅使用一種方式進行特徵選取", "將資料分成多個子任務"],
        "answer": "B"
    },
    {
        "question": "標準化和正規化在處理異常值時的主要區別是什麼?",
        "options": ["標準化對異常值更穩健", "正規化對異常值更穩健", "兩者對異常值的處理相同", "兩者都不能處理異常值"],
        "answer": "A"
    },
    {
        "question": "特徵工程的四個子問題包括哪些？",
        "options": ["特徵處理、特徵選取、特徵擷取、特徵分解", "特徵處理、特徵選取、特徵提取、特徵構造", "特徵分類、特徵選取、特徵擷取、特徵分解", "特徵處理、特徵分類、特徵提取、特徵構造"],
        "answer": "B"
    },
    {
        "question": "在分類問題中，哪種特徵處理方法可以將分類標註為 1 與 0？",
        "options": ["獨熱編碼 (One-Hot Encoding)", "正規化 (Normalization)", "標準化 (Standardization)", "主成分分析 (PCA)"],
        "answer": "A"
    },
    {
        "question": "特徵選擇有哪些好處？",
        "options": ["降低模型精準度", "增加特徵數量", "提高模型精準度並減少訓練時間", "增加模型訓練時間"],
        "answer": "C"
    },
    {
        "question": "過濾 (Filter) 方法的優勢在於？",
        "options": ["計算效率", "減少冗餘特徵", "提高解釋性", "避免過擬合"],
        "answer": "A"
    },
    {
        "question": "特徵選取與特徵提取的區別是什麼？",
        "options": ["特徵選取關注模型精準度、特徵提取關注模型複雜度", "特徵選取挑選重要屬性、特徵提取將多個屬性轉換為少數特徵", "特徵選取與特徵提取皆關注模型精準度", "特徵選取關注模型複雜度、特徵提取關注模型精準度"],
        "answer": "B"
    },
    {
        "question": "特徵構造的目的是什麼？",
        "options": ["增加模型的複雜度", "減少特徵數量", "提高模型的解釋性", "學習特徵間的關係並創造新的特徵"],
        "answer": "D"
    },
    {
        "question": "機器學習資料分析的主要目的是什麼？",
        "options": ["使用較有意義的變數來學習模型", "尋找高維函數", "降低維度", "擬合訓練資料集"],
        "answer": "A"
    },
    {
        "question": "什麼是降維？",
        "options": ["將資料特徵變得簡單", "將資料投影到捕獲資料「本質」的低維子空間", "找到自變數與因變數的相關性", "避免過度擬合訓練資料集"],
        "answer": "B"
    },
    {
        "question": "以下哪個不是降維技術？",
        "options": ["資料清理", "矩陣分解", "流形學習", "自編碼器方法"],
        "answer": "A"
    },
    {
        "question": "基於相關性特徵選取 (CFS) 的主要目標是什麼？",
        "options": ["將資料分為多個子集", "測試資料集的相關性", "評估資料集自變數與目標變數間相關係", "找到具有低特徵-特徵相關性和高特徵類相關性的特徵子集"],
        "answer": "D"
    },
    {
        "question": "探索性資料分析 (EDA) 的主要目的是什麼？",
        "options": ["降低維度", "縮減資料集", "了解給定的資料集並幫助清理給定的資料集", "評估模型在新資料上的表現"],
        "answer": "C"
    },
    {
        "question": "主成分分析 (PCA) 是使用哪種方法得到的結果？",
        "options": ["線性代數方法", "特徵選擇方法", "流形學習", "自編碼器方法"],
        "answer": "A"
    },
    {
        "question": "LDA 是一種什麼類型的演算法？",
        "options": ["監督式降維度演算法", "非監督式降維度演算法", "分類演算法", "聚類演算法"],
        "answer": "A"
    },
    {
        "question": "LDA 的主要目的是什麼？",
        "options": ["最大化類別間距散佈並最小化類別內散佈", "最小化類別間距散佈並最大化類別內散佈", "同時最大化類別間距散佈和類別內散佈", "同時最小化類別間距散佈和類別內散佈"],
        "answer": "A"
    },
    {
        "question": "特徵選擇的目的是什麼？",
        "options": ["提高訓練速度", "提高模型的可解釋性", "提高測試集的泛化性能", "找到和選擇最有用的特徵"],
        "answer": "D"
    },
    {
        "question": "在特徵選擇方法中，如何處理缺失值百分比高的特徵？",
        "options": ["刪除部分缺失值高於指定閥值的特徵", "填補缺失值", "保留缺失值", "將缺失值視為特殊類別"],
        "answer": "A"
    },
    {
        "question": "Pearson 相關係數的值範圍是多少？",
        "options": ["0 到 1", "-1 到 0", "-1 到+1", "1 到 2"],
        "answer": "C"
    },
    {
        "question": "基於決策樹模型中，重要性為零的特徵指的是什麼？",
        "options": ["特徵在模型中具有高度相關性", "特徵不用於拆分任何節點", "特徵只有單個值", "特徵具有很高的方差"],
        "answer": "B"
    },
    {
        "question": "資料降維的常見技巧包括以下哪些方法？",
        "options": ["增強神經網路", "線性回歸、決策樹、支持向量機、K-means", "缺失值比率、低方差過濾、高相關過濾、隨機森林/集成樹、主成分分析 (PCA)、線性判別 (LDA)、向後特徵消除、前向特徵構建", "神經網絡、深度學習、卷積神經網絡、遞歸神經網絡"],
        "answer": "C"
    },
    {
        "question": "非線性映射的主成分分析技術被稱為什麼？",
        "options": ["線性 PCA", "內核 PCA", "隨機森林 PCA", "擴展 PCA"],
        "answer": "B"
    },
    {
        "question": "線性判別分析(LDA)的主要用途是什麼？",
        "options": ["找到特徵或分離兩類或更多類對象或事件的特徵的線性組合", "計算方差和共變異數", "降低資料維度", "解決分類問題"],
        "answer": "A"
    },
    {
        "question": "自編碼器是什麼類型的神經網絡？",
        "options": ["卷積神經網絡", "遞歸神經網絡", "深度神經網絡", "自然語言神經網絡"],
        "answer": "C"
    },
    {
        "question": "基於統計的特徵選擇方法的主要目的是什麼？",
        "options": ["選擇與目標變量具有最強關係的輸入變量", "減少過擬合", "提高訓練速度", "提高模型準確性"],
        "answer": "A"
    },
    {
        "question": "Pearson 相關性衡量的是什麼？",
        "options": ["特徵和目標變量之間的關係", "特徵和目標變量之間的線性關係", "特徵之間的關係", "特徵和目標變量之間的非線性關係"],
        "answer": "C"
    },
    {
        "question": "機器學習是哪個領域的子領域?",
        "options": ["計算機科學", "數學", "物理", "化學"],
        "answer": "A"
    },
    {
        "question": "機器學習的三大類別有哪些?",
        "options": ["監督學習、半監督學習、轉導", "監督學習、無監督學習、密度估計", "監督學習、無監督學習、回歸", "監督學習、無監督學習、強化學習"],
        "answer": "D"
    },
    {
        "question": "監督學習的主要目標是什麼?",
        "options": ["對看不見的或未來的資料進行預測", "尋找輸入資料中的結構", "與動態環境交互執行目標", "發現輸入在某個空間中的分佈"],
        "answer": "A"
    },
    {
        "question": "人臉識別技術是監督學習的哪個子類別?",
        "options": ["回歸", "分類", "聚集", "密度估計"],
        "answer": "B"
    },
    {
        "question": "垃圾郵件過濾是哪種類型的機器學習任務的典型例子?",
        "options": ["強化學習", "回歸", "分類", "無監督學習"],
        "answer": "C"
    },
    {
        "question": "回歸分析的目標是什麼?",
        "options": ["發現輸入在某個空間中的分佈", "尋找輸入資料中的結構", "與動態環境交互執行目標", "預測連續結果"],
        "answer": "D"
    },
    {
        "question": "監督學習、無監督學習和強化學習之間的區別是什麼？",
        "options": ["需要正確答案，無監督學習不需要答案，強化學習不需要獎勵函數", "習需要正確答案，無監督學習需要答案，強化學習需要獎勵函數", "習需要正確答案，無監督學習不需要答案，強化學習需要獎勵信號", "習需要正確答案，無監督學習需要答案，強化學習不需要獎勵函數"],
        "answer": "C"
    },
    {
        "question": "聚集是一種什麼樣的技術？",
        "options": ["無監督學習技術", "監督學習技術", "強化學習技術", "降維技術"],
        "answer": "A"
    },
    {
        "question": "降維在無監督學習中的主要作用是什麼？",
        "options": ["提高聚類效果", "提高分類效果", "提高強化學習效果", "去除資料噪聲並壓縮資料到更小的維度子空間"],
        "answer": "D"
    },
    {
        "question": "強化學習中，代理是如何提高其性能的？",
        "options": ["通過最小化誤差", "通過與環境的互動", "通過正確答案的反饋", "通過無監督學習技術"],
        "answer": "B"
    },
    {
        "question": "邏輯回歸在機器學習中的主要應用是什麼？",
        "options": ["分類問題", "回歸問題", "聚類問題", "降維問題"],
        "answer": "A"
    },
    {
        "question": "決策樹分類器是通過什麼方式進行學習的？",
        "options": ["最大化誤差", "最小化邊距", "在導致最大訊息增益的特徵上拆分資料", "通過正確答案的反饋"],
        "answer": "C"
    },
    {
        "question": "損失函數的主要作用是什麼？",
        "options": ["衡量算法是否做得好", "預測輸出結果", "調整演算法的工作方式", "建立模型"],
        "answer": "A"
    },
    {
        "question": "交叉熵可以用於哪些類型的問題？",
        "options": ["僅二元分類問題", "僅多類分類問題", "僅回歸問題", "二元和多類分類問題"],
        "answer": "D"
    },
    {
        "question": "Log-loss 是哪種損失函數的另一種表示？",
        "options": ["均方誤差", "二元交叉熵", "分類交叉熵", "稀疏交叉熵"],
        "answer": "B"
    },
    {
        "question": "回歸的目標是什麼？",
        "options": ["分類問題", "預測實值數量", "分類和回歸問題", "建立機器學習模型"],
        "answer": "B"
    },
    {
        "question": "MSE 函數對哪種值非常敏感？",
        "options": ["異常值", "平均值", "最小值", "中位數"],
        "answer": "A"
    },
    {
        "question": "Huber 損失函數是哪兩種損失函數的組合？",
        "options": ["均方誤差和二元交叉熵", "均方誤差和分類交叉熵", "均方誤差和平均絕對誤差", "平均絕對誤差和二元交叉熵"],
        "answer": "C"
    },
    {
        "question": "MSE 的主要優點是什麼？",
        "options": ["確保模型沒有帶有巨大誤差的異常值", "放大誤差", "不對異常值施加過多權重", "提供了一個通用的模型性能衡量標準"],
        "answer": "A"
    },
    {
        "question": "MAE 的主要優點是什麼？",
        "options": ["確保模型沒有帶有巨大誤差的異常值", "放大誤差", "對異常值施加過多權重", "不對異常值施加過多權重並提供通用的模型性能衡量標準"],
        "answer": "D"
    },
    {
        "question": "與 RMSE 相關的關鍵點包括哪些？",
        "options": ["保留了 MAE 的可微特性", "保留了 MSE 的可微特性並對較小錯誤進行平方根處理", "不對異常值施加過多權重", "與隨機變量具有相同的尺度"],
        "answer": "B"
    },
    {
        "question": "R2 決定係數的目的是什麼？",
        "options": ["說明目標的總變化中有多少被輸入的變化解釋的問題", "衡量模型的異常值預測", "衡量模型在大多數情況下的表現", "對異常值施加更大的權重"],
        "answer": "A"
    },
    {
        "question": "精確度 (Precision) 主要關注哪一類錯誤？",
        "options": ["I 類錯誤", "II 類錯誤", "保留了 MSE 的可微特性", "與隨機變量具有相同的尺度"],
        "answer": "A"
    },
    {
        "question": "F1 分數的目的是什麼？",
        "options": ["確保模型沒有帶有巨大誤差的異常值", "放大誤差", "找到精確度和召回率之間的平衡點", "提供了一個通用的模型性能衡量標準"],
        "answer": "C"
    },
    {
        "question": "學習時視覺吸收知識的比率佔多少百分比?",
        "options": ["87%", "75%", "65%", "90%"],
        "answer": "A"
    },
    {
        "question": "解析度是由什麼組成?",
        "options": ["像素顏色", "像素大小", "像素形狀", "像素的行數和列數"],
        "answer": "D"
    },
    {
        "question": "卷積運算在卷積神經網路中被稱為什麼?",
        "options": ["convolution", "activation", "backpropagation", "normalization"],
        "answer": "A"
    },
    {
        "question": "池化的目的是什麼?",
        "options": ["增加特徵數量", "壓縮特徵圖並保留主要特徵", "提高計算複雜度", "提高解析度"],
        "answer": "B"
    },
    {
        "question": "以下哪個不是池化的一種類型?",
        "options": ["average pooling", "max pooling", "min pooling", "convolution pooling"],
        "answer": "D"
    },
    {
        "question": "過擬合表示模型對哪部分的資料過度學習?",
        "options": ["訓練資料", "測試資料", "驗證資料", "未知資料"],
        "answer": "A"
    },
    {
        "question": "卷積層的權重也被稱為什麼?",
        "options": ["璇臬漲", "損失函數", "濾波器", "激活函數"],
        "answer": "C"
    },
    {
        "question": "卷積神經網路（CNN）最適合處理哪種類型的輸入？",
        "options": ["文字", "照片或影片", "聲音", "數據表"],
        "answer": "B"
    },
    {
        "question": "表示 0~255 需要用多少位的二進制表示？",
        "options": ["8", "7", "6", "9"],
        "answer": "A"
    },
    {
        "question": "彩色圖像是由哪三個圖層疊加而成？",
        "options": ["R、B、Y", "R、G、Y", "R、B、W", "R、G、B"],
        "answer": "D"
    },
    {
        "question": "進行池化可以達到哪個目的？",
        "options": ["增加計算複雜度", "降低計算複雜度", "增加特徵數量", "增強特徵部分"],
        "answer": "B"
    },
    {
        "question": "哪種池化方法可以保留主要特徵？",
        "options": ["平均池化", "中值池化", "最大池化", "最小池化"],
        "answer": "C"
    },
    {
        "question": "過擬合是指什麼？",
        "options": ["模型過度學習訓練資料而無法正常預測新資料", "模型未學習到足夠的特徵", "模型權重過大導致計算複雜度過高", "模型權重過小導致計算複雜度過低"],
        "answer": "A"
    },
    {
        "question": "CNN 中的卷積層主要用於做什麼？",
        "options": ["降採樣", "壓縮影像", "分類影像", "提取特徵"],
        "answer": "D"
    },
    {
        "question": "卷積層的權重是什麼？",
        "options": ["濾波器", "激活函數", "損失函數", "偏置值"],
        "answer": "A"
    },
    {
        "question": "池化層的主要目的是什麼？",
        "options": ["提取特徵", "增加計算複雜度", "降採樣", "增強特徵部分"],
        "answer": "C"
    },
    {
        "question": "卷積運算（convolution）通常用於哪種神經網路？",
        "options": ["循環神經網路（RNN）", "卷積神經網路（CNN）", "長短時記憶網路（LSTM）", "感知器神經網路（Perceptron）"],
        "answer": "B"
    },
    {
        "question": "卷積運算的主要目的是什麼？",
        "options": ["特徵提取", "降維", "優化", "增強影像對比度"],
        "answer": "A"
    },
    {
        "question": "卷積神經網路（CNN）通常包括哪三種層？",
        "options": ["卷積層、池化層、循環層", "卷積層、循環層、輸出層", "卷積層、長短時記憶層、全連接層", "卷積層、池化層、全連接層"],
        "answer": "D"
    },
    {
        "question": "在卷積神經網路中，濾波器的作用是什麼？",
        "options": ["降低計算複雜度", "增強影像對比度", "提取特徵", "壓縮數據"],
        "answer": "C"
    },
    {
        "question": "卷積層中的濾波器變大對輸出特徵圖的影響是什麼？",
        "options": ["增加特徵圖尺寸", "減小特徵圖尺寸", "增加計算複雜度", "降低模型效果"],
        "answer": "B"
    },
    {
        "question": "在卷積神經網路中，池化層的主要功能是什麼？",
        "options": ["降採樣", "特徵提取", "增強影像對比度", "優化"],
        "answer": "A"
    },
    {
        "question": "在卷積神經網路中，全連接層的主要作用是什麼？",
        "options": ["特徵提取", "降採樣", "壓縮數據", "分類或回歸"],
        "answer": "D"
    },
    {
        "question": "在卷積神經網路中，填充（padding）的作用是什麼？",
        "options": ["降低計算複雜度", "壓縮數據", "保持特徵圖尺寸", "增強影像對比度"],
        "answer": "C"
    },
    {
        "question": "在卷積神經網路中，步幅（stride）的作用是什麼？",
        "options": ["增強特徵部分", "控制特徵圖尺寸", "優化", "降低模型效果"],
        "answer": "B"
    },
    {
        "question": "在卷積神經網路中，選擇合適的濾波器數量對模型的影響是什麼？",
        "options": ["影響模型的特徵提取能力", "降低計算複雜度", "增強影像對比度", "壓縮數據"],
        "answer": "A"
    },
    {
        "question": "語言學主要研究哪方面的知識?",
        "options": ["人類語言", "物理學", "化學", "生物學"],
        "answer": "A"
    },
    {
        "question": "自然語言處理（NLP）的基本部分包括哪些?",
        "options": ["認知、理解、生成", "溝通、評估、設計", "計算、分析、整合", "編碼、解碼、優化"],
        "answer": "A"
    },
    {
        "question": "自然語言處理面臨的困難之一是什麼?",
        "options": ["單詞的邊界界定", "單詞的排序", "單詞的分類", "單詞的組合"],
        "answer": "A"
    },
    {
        "question": "詞義消歧是自然語言處理的哪個挑戰?",
        "options": ["句法的模糊性", "有瑕疵的或不規範的輸入", "詞義消歧", "語言行為與計劃"],
        "answer": "C"
    },
    {
        "question": "將句子分解為字詞單位的過程稱為什麼?",
        "options": ["斷詞", "詞性標註", "命名實體識別", "分塊"],
        "answer": "A"
    },
    {
        "question": "去除單詞前後綴以得到詞根的過程叫什麼?",
        "options": ["詞性標註", "詞幹提取", "詞性還原", "詞形還原"],
        "answer": "B"
    },
    {
        "question": "將單詞從複雜形態轉變為基礎形態的過程叫什麼?",
        "options": ["分塊", "詞性標註", "命名實體識別", "詞形還原"],
        "answer": "D"
    },
    {
        "question": "根據單詞含義和上下文內容進行詞性標記的過程叫什麼?",
        "options": ["詞性還原", "詞幹提取", "詞性標註", "分塊"],
        "answer": "C"
    },
    {
        "question": "從句子中提取特定類型實體的過程叫什麼?",
        "options": ["命名實體識別", "斷詞", "詞性標註", "詞形還原"],
        "answer": "A"
    },
    {
        "question": "將一大段文本分割成幾段小文本的過程叫什麼?",
        "options": ["詞性還原", "分塊", "詞性標註", "詞幹提取"],
        "answer": "B"
    },
    {
        "question": "為了讓計算機能夠計算或使用語言資料，我們需要將語言資料轉換成什麼形\n式?",
        "options": ["數字", "圖像", "聲音", "表情符號"],
        "answer": "A"
    },
    {
        "question": "頻率分析最早的記載是由哪位學者所使用？",
        "options": ["莎士比亞", "愛因斯坦", "達文西", "Al -Kindi"],
        "answer": "D"
    },
    {
        "question": "英文中最常出現的字母是什麼?",
        "options": ["A", "T", "E", "O"],
        "answer": "C"
    },
    {
        "question": "詞頻（TF）是用來衡量什麼的指標?",
        "options": ["詞彙的排序", "詞彙的重要性", "詞彙的相似性", "詞彙的相關性"],
        "answer": "B"
    },
    {
        "question": "詞袋模型（BOW）的主要作用是什麼?",
        "options": ["將一段文字的所有字詞整理出來並存入一個容器", "將一段文字翻譯成另一種語言", "將一段文字分析出詞性標註", "將一段文字分析出句子結構"],
        "answer": "A"
    },
    {
        "question": "機器學習是什麼的一種方法？",
        "options": ["人工智慧", "資料分析", "大數據", "物聯網"],
        "answer": "A"
    },
    {
        "question": "機器學習的目的是什麼？",
        "options": ["生成規則", "提升目標效能", "提高資料儲存量", "降低成本"],
        "answer": "B"
    },
    {
        "question": "機器學習方法可以應用在哪些產業？",
        "options": ["建築業", "颲脫平", "食品業", "金融服務、智慧製造、生物醫療等許多產業"],
        "answer": "D"
    },
    {
        "question": "機器學習方法起源於哪個時期？",
        "options": ["1960", "1980", "2000", "2010"],
        "answer": "B"
    },
    {
        "question": "機器學習在電子郵件中可以用來做什麼？",
        "options": ["提高郵件傳送速度", "改善郵件排版", "垃圾郵件和惡意軟體過濾", "增加郵件儲存空間"],
        "answer": "C"
    },
    {
        "question": "哪家公司使用機器學習來防止洗錢？",
        "options": ["PayPal", "Google", "Amazon", "Microsoft"],
        "answer": "A"
    },
    {
        "question": "機器學習在搜索引擎結果精煉中的應用是什麼？",
        "options": ["改進搜索結果", "提高廣告收入", "增加網站訪問量", "提高網站排名"],
        "answer": "A"
    },
    {
        "question": "在線客戶服務中聊天機器人的功能是什麼？",
        "options": ["自動回覆郵件", "自動發送推廣信息", "管理客戶賬戶", "從網站中提取信息並呈現給客戶"],
        "answer": "D"
    },
    {
        "question": "垃圾郵件分類是哪種機器學習的案例？",
        "options": ["監督式學習", "非監督式學習", "半監督式學習", "強化式學習"],
        "answer": "A"
    },
    {
        "question": "以下哪一種學習方式常見於分類問題和迴歸問題？",
        "options": ["監督式學習", "非監督式學習", "半監督式學習", "強化式學習"],
        "answer": "A"
    },
    {
        "question": "非監督式學習的一個可能缺點是什麼？",
        "options": ["需要大量的標註資料", "可能把不重要的特性過度放大", "無法自動更新模型", "需要與環境互動學習"],
        "answer": "B"
    },
    {
        "question": "根據資料的數量選擇機器學習方式時，當資料數量高但機器比較不容易去辨\n識資料的種類，應該使用哪種學習方式？",
        "options": ["監督式學習", "非監督式學習", "半監督式學習", "強化式學習"],
        "answer": "C"
    },
    {
        "question": "根據 Algorithmia 的報告，在 2020 年有多少比例的企業將機器學習與人\n工智慧技術列為優先開發的事項？",
        "options": ["56%", "76%", "33%", "89%"],
        "answer": "B"
    },
    {
        "question": "據報告，從 2019 年到 2020 年，有多少比例的企業表示人工智慧與機器學\n習的預算提升多 50%？",
        "options": ["7%", "20%", "15%", "25%"],
        "answer": "B"
    },
    {
        "question": "機器學習在哪個領域應用十分廣泛？",
        "options": ["圖像辨識、語音辨識、醫療診斷、統計套利、學習關聯、 分類、預測、回歸", "網路安全、自然語言處理、行銷、遊戲", "物聯網、智慧家庭、自動駕駛、機器人", "氣象預報、電影推薦、音樂創作、教育"],
        "answer": "A"
    },
    {
        "question": "機器學習在醫療方面的應用包括什麼？",
        "options": ["圖像辨識、語音辨識、醫療診斷、統計套利", "預測疾病進展、提取對結果研究的醫學知識、對治療的計畫和以及全面的患\n者管理", "物聯網、智慧家庭、自動駕駛、機器人", "氣象預報、電影推薦、音樂創作、教育"],
        "answer": "B"
    },
    {
        "question": "語音識別的過程也被稱為什麼？",
        "options": ["自動語音識別", "語音合成", "聲紋辨識", "語音生成"],
        "answer": "A"
    },
    {
        "question": "在金融領域，機器學習常被用於什麼策略？",
        "options": ["資料挖掘", "統計套利", "風險管理", "信用評分"],
        "answer": "B"
    },
    {
        "question": "從技術角度看，機器學習的第一個趨勢是什麼？",
        "options": ["無代碼機器學習", "微型機器學習", "自動機器學習", "機器學習運營化管理"],
        "answer": "A"
    },
    {
        "question": "無代碼機器學習與其他機器學習方法有什麼不同？",
        "options": ["它使用拖放方法", "它需要更多的專業背景知識", "它需要更多時間來處理數據", "它效率較低"],
        "answer": "A"
    },
    {
        "question": "什麼是微型機器學習？",
        "options": ["一個用於數據處理和比較的大型服務器", "一個用於數據處理和比較的小型服務器", "一種改善數據標註結果的方法", "一種管理機器學習運營的方法"],
        "answer": "B"
    },
    {
        "question": "什麼是自動機器學習？",
        "options": ["一種類似於無代碼機器學習的方法 它簡化了開發過程並融合了自動化技術", "一種比無代碼機器學習需要更多專業背景知識的方法", "一種通過減少人為錯誤和偏見來改善數據標註結果的方法", "以上皆是"],
        "answer": "D"
    },
    {
        "question": "什麼是機器學習運營化管理？",
        "options": ["一種通過提供公式來統一機器學習開發過程和部署的方法，並通過自動化和\n六步循環實現。", "一種使用庫和框架在深度學習和用戶之間建立橋樑的方法。", "一種通過兩個不同網絡之間的互動（生成器和判別器）產生更高精度和可靠\n性的方法。", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "什麼是生成對抗網絡？",
        "options": ["一種通過兩個不同網絡之間的互動（生成器和判別器）產生更高精度和可靠\n性的方法。", "一種使用庫和框架在深度學習和用戶之間建立橋樑的方法。", "一種通過提供公式來統一機器學習開發過程和部署的方法，並通過自動化和\n六步循環實現。", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "機器學習的第七個趨勢是什麼？",
        "options": ["無監督式機器學習", "強化式學習", "少拍 一拍 零拍學習", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "什麼是無監督式機器學習？",
        "options": ["一種需要數據標記的方法", "一種在沒有指導和數據標記的情況下能夠得出自己結論的方法", "一種比監督式學習需要更多專業背景知識的方法", "一種比監督式學習效率低的方法"],
        "answer": "B"
    },
    {
        "question": "什麼是強化式學習？",
        "options": ["一種直接從與環境的互動中學習，並擁有獎懲機制以尋找最佳解決方案的方\n法", "一種用於數據處理和比較的大型服務器", "一種簡化開發過程並融合自動化技術的方法", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "什麼是少拍學習？",
        "options": ["一種注重有限數據並可用於許多應用（如圖像分類和面部識別）的方法", "一種需要大量初始數據的方法", "一種可用於極其複雜解決方案的方法", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "什麼是一拍學習？",
        "options": ["一種比少拍學習使用更少數據但需要現有數據的方法", "一種不需要任何初始數據的方法", "一種可用於極其複雜解決方案的方法", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "什麼是零拍學習？",
        "options": ["一種需要大量初始數據的方法", "一種不需要任何初始數據且能通過觀察物體推斷物體類別的方法", "一種僅適用於簡單解決方案的方法", "以上皆非"],
        "answer": "B"
    },
    {
        "question": "無監督式機器學習的特點是什麼?",
        "options": ["需要標記數據", "不需要標記數據", "在有指導的情況下取得結論", "無法取得自己的結論"],
        "answer": "B"
    },
    {
        "question": "強化式學習適合用於哪些應用領域?",
        "options": ["電動遊戲、棋盤遊戲、人工智能", "資料結構研究", "圖像分類、對象檢測", "自然語言處理"],
        "answer": "A"
    },
    {
        "question": "強化式學習中，系統的目標是什麼?",
        "options": ["最低的獎勵", "最高的懲罰", "最低的懲罰", "最高的獎勵"],
        "answer": "D"
    },
    {
        "question": "少拍學習的限制是什麼?",
        "options": ["無法用於圖像分類", "無法用於臉部辨識", "無法用於極端複雜的解決方案", "無法用於文字分類"],
        "answer": "C"
    },
    {
        "question": "在一拍學習中，數據需具備哪些特點?",
        "options": ["已經存在的數據", "不存在的數據", "大量數據", "標記過的數據"],
        "answer": "A"
    },
    {
        "question": "零拍學習可以用於哪些功能?",
        "options": ["資料結構研究", "圖像分類、對象檢測、語言處理", "遊戲設計", "網站開發"],
        "answer": "B"
    },
    {
        "question": "人工智慧與機器學習之間的關係是什麼？",
        "options": ["人工智慧是機器學習的子集", "機器學習是人工智慧的子集", "二者是完全獨立的領域", "二者是相互競爭的技術"],
        "answer": "B"
    },
    {
        "question": "深度學習與機器學習之間的關係是什麼？",
        "options": ["深度學習與機器學習是相同的概念", "深度學習是機器學習的子集", "機器學習是深度學習的子集", "深度學習和機器學習互相獨立"],
        "answer": "B"
    },
    {
        "question": "機器學習大致上可以分為哪三類？",
        "options": ["監督式學習、非監督式學習和增強式學習", "深度學習、非監督式學習和增強式學習", "監督式學習、深度學習和非監督式學習", "監督式學習、非監督式學習和半監督式學習"],
        "answer": "A"
    },
    {
        "question": "以下哪個是回歸分析的一種機器學習演算法？",
        "options": ["KNN 演算法", "決策樹", "支持向量機", "隨機森林"],
        "answer": "C"
    },
    {
        "question": "KNN 演算法中的 K 值的作用是什麼？",
        "options": ["用於計算距離", "用於確定樣本類別", "用於決定投影的維度", "用於選擇最近的鄰居數量"],
        "answer": "D"
    },
    {
        "question": "非監督式學習的主要應用場景是什麼？",
        "options": ["分群", "分類", "回歸", "增強式學習"],
        "answer": "A"
    },
    {
        "question": "深度學習是哪個領域的分支？",
        "options": ["自然語言處理", "機器學習", "圖形處理", "計算機視覺"],
        "answer": "B"
    },
    {
        "question": "深度學習演算法主要使用哪種處理器進行運算？",
        "options": ["CPU", "GPU", "RAM", "SSD"],
        "answer": "B"
    },
    {
        "question": "深度學習的哪個特性使其在大數據環境中性能更優？",
        "options": ["數據依賴度", "特徵工程", "多層神經網路", "迴歸分析"],
        "answer": "A"
    },
    {
        "question": "在深度學習中，特徵工程是什麼？",
        "options": ["提高數據的複雜性", "提取數據的關鍵特徵", "模型選擇與優化", "將領域知識應用於特徵提取的過程"],
        "answer": "D"
    },
    {
        "question": "深度學習卷積網路最早的應用之一，LeNet-5，是由哪位學者引入的？",
        "options": ["Yann LeCun", "Geoffrey Hinton", "Andrew Ng", "Yoshua Bengio"],
        "answer": "A"
    },
    {
        "question": "分類、迴歸和聚類是哪個領域的方法？",
        "options": ["深度學習", "機器學習", "計算機視覺", "數據挖掘"],
        "answer": "B"
    },
    {
        "question": "以下哪種方法是一種用於文本主題提取的降維技術？",
        "options": ["主成分分析 (PCA)", "獨立成分分析 (ICA)", "線性判別分析 (LDA)", "潛在語言分析 (LSA)"],
        "answer": "D"
    },
    {
        "question": "以下哪個方法主要用於從混合資料中提取出原始的獨立信號？",
        "options": ["主成分分析 (PCA)", "獨立成分分析 (ICA)", "線性判別分析 (LDA)", "潛在語言分析 (LSA)"],
        "answer": "B"
    },
    {
        "question": "資料維度縮減的主要目的是什麼？",
        "options": ["減少變數的個數", "提高維度", "增加資料複雜度", "提高載入時間"],
        "answer": "A"
    },
    {
        "question": "以下哪個方法是監督學習的降維技術？",
        "options": ["主成分分析 (PCA)", "獨立成分分析 (ICA)", "線性判別分析 (LDA)", "潛在語言分析 (LSA)"],
        "answer": "C"
    },
    {
        "question": "請問在自然語言處理 (NLP) 的應用上，哪個降維方法較為適合？",
        "options": ["主成分分析 (PCA)", "獨立成分分析 (ICA)", "線性判別分析 (LDA)", "潛在語言分析 (LSA)"],
        "answer": "D"
    },
    {
        "question": "以下哪種方法是一種將多維空間中的研究對象簡化到低維空間進行定位、分\n析及歸類的方法？",
        "options": ["獨立成分分析 (ICA)", "線性判別分析 (LDA)", "潛在語言分析 (LSA)", "多維尺度法 (MDS)"],
        "answer": "D"
    },
    {
        "question": "監督式學習常用的演算法有哪些？",
        "options": ["邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa", "多層感知機模型、深度神經網路模型、遞迴神經網路模型"],
        "answer": "A"
    },
    {
        "question": "非監督式學習常用的演算法有哪些？",
        "options": ["邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa", "多層感知機模型、深度神經網路模型、遞迴神經網路模型"],
        "answer": "B"
    },
    {
        "question": "強化式學習常用的演算法有哪些？",
        "options": ["邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa", "多層感知機模型、深度神經網路模型、遞迴神經網路模型"],
        "answer": "C"
    },
    {
        "question": "深度學習的基本模型大致分為哪三類？",
        "options": ["邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa", "多層感知機模型、深度神經網路模型、遞迴神經網路模型"],
        "answer": "D"
    },
    {
        "question": "卷積神經網路(CNN)的基本運算單元包括哪些？",
        "options": ["卷積運算、池化運算、全連線運算和識別運算", "邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa"],
        "answer": "A"
    },
    {
        "question": "遞迴神經網路(RNN)可以結合哪種模型來解決長時間的關聯問題？",
        "options": ["邏輯回歸、決策樹、KNN、SVM", "K-Means、GAN、SOM", "Q Learning、Sarsa", "長短期記憶模型 (Long short-term memory LSTM)"],
        "answer": "D"
    },
    {
        "question": "線性代數在機器學習中的主要應用是什麼？",
        "options": ["解決向量問題", "表示和運算資料", "解決微分方程", "計算機率"],
        "answer": "A"
    },
    {
        "question": "線性方程組在機器學習中的應用是？",
        "options": ["找到最大誤差解", "計算梯度", "表示資料", "最小平方法求解問題"],
        "answer": "D"
    },
    {
        "question": "梯度在機器學習中的重要性是什麼？",
        "options": ["指向函數上升最快速率的方向", "表示資料", "計算機率", "解決微分方程"],
        "answer": "A"
    },
    {
        "question": "多變量微分在機器學習中的重要性是什麼？",
        "options": ["計算機率", "表示資料", "處理多變數目標函數", "解決微分方程"],
        "answer": "C"
    },
    {
        "question": "機器學習中機率的主要目的是什麼？",
        "options": ["解決向量問題", "找到機率密度分佈函數", "計算梯度", "處理多變數目標函數"],
        "answer": "B"
    },
    {
        "question": "機器學習和統計學的主要區別是什麼？",
        "options": ["機器學習旨在使預測盡可能準確而統計模型用於推斷變數之間的關係", "解決向量問題", "計算機率", "處理多變數目標函數"],
        "answer": "A"
    },
    {
        "question": "機器學習基礎數學內容主要包含哪些？",
        "options": ["邏輯真值表、一次與二次函數、線性代數、多變量微積分、指數對數運算、\n機率、統計、最佳化", "代數、三角函數、解析幾何、微積分", "矩陣、線性方程組、向量空間、微分方程", "算術、代數、幾何、三角學"],
        "answer": "A"
    },
    {
        "question": "在機器學習中，線性回歸使用哪種數學方法？",
        "options": ["最大似然度", "最小平方", "梯度下降法", "最小邊限"],
        "answer": "B"
    },
    {
        "question": "線性方程組 Ax=b 的解可以用哪種方式表示？",
        "options": ["x=A^(−1)b", "x=Ab", "X=A^T*b", "x=A+b"],
        "answer": "A"
    },
    {
        "question": "Orange 3 的主要焦點是什麼？",
        "options": ["超參數調整", "數據分析和機器學習任務", "網頁開發", "圖像處理"],
        "answer": "B"
    },
    {
        "question": "Orange 3 中哪個小部件允許您在工作流中編寫自定義 Python 代碼？",
        "options": ["Data Sampler", "Python Script", "Random Forest", "Preprocess"],
        "answer": "B"
    },
    {
        "question": "在 Orange 3 中可以使用哪個 Python 庫進行貝葉斯優化？",
        "options": ["scikit-optimize", "pandas", "matplotlib", "TensorFlow"],
        "answer": "A"
    },
    {
        "question": "hyperopt 庫的 fmin 函數有什麼作用？",
        "options": ["擬合機器學習模型", "執行貝葉斯優化", "繪製直方圖", "從 CSV 文件讀取數據"],
        "answer": "B"
    },
    {
        "question": "Orange 3 中哪個小部件可用於從文件加載數據？",
        "options": ["Random Forest", "Python Script", "File", "Test & Score"],
        "answer": "C"
    },
    {
        "question": "RandomForestClassifier 中的 max_depth 參數的目的是什麼？",
        "options": ["森林中的樹木數量", "在分割節點時要考慮的最大特徵數", "樹的最大深度", "用於分割節點的準則"],
        "answer": "C"
    },
    {
        "question": "哪個函數用於定義貝葉斯優化的目標函數？",
        "options": ["objective_function", "objective", "loss_function", "optimize"],
        "answer": "B"
    },
    {
        "question": "在貝葉斯優化中，STATUS_OK 常量表示什麼？",
        "options": ["最優狀態", "收斂狀態", "錯誤狀態", "成功狀態"],
        "answer": "D"
    },
    {
        "question": "哪個 Python 庫提供對貝葉斯優化的支持？",
        "options": ["pandas", "scikit-learn", "matplotlib", "scikit-optimize"],
        "answer": "D"
    },
    {
        "question": "Orange 3 中 Test & Score 小部件的主要目的是什麼？",
        "options": ["預處理數據", "訓練機器學習模型", "評估模型性能", "可視化數據"],
        "answer": "C"
    },
    {
        "question": "貝葉斯優化在機器學習中主要用於什麼？",
        "options": ["特徵選擇", "超參數調整", "數據可視化", "模型部署"],
        "answer": "B"
    },
    {
        "question": "以下哪一項不是 Orange 3 的內置功能？",
        "options": ["數據可視化", "機器學習模型", "數據預處理", "高級貝葉斯優化"],
        "answer": "D"
    },
    {
        "question": "Orange 3 中 Python Script 小部件的目的是什麼？",
        "options": ["僅顯示數據", "從畫布中刪除數據", "編寫和執行自定義 Python 代碼", "自動導出結果"],
        "answer": "C"
    },
    {
        "question": "哪個庫通常不用於貝葉斯優化？",
        "options": ["hyperopt", "scikit-optimize", "bayesian-optimization", "matplotlib"],
        "answer": "D"
    },
    {
        "question": "以下哪個方法不屬於 Python 的 sklearn 庫用於超參數調整？",
        "options": ["GridSearchCV", "RandomizedSearchCV", "hyperopt 的 fmin", "以上都不是"],
        "answer": "C"
    },
    {
        "question": "貝葉斯優化函數通常最大化什麼？",
        "options": ["模型的複雜性", "目標函數", "參數的數量", "訓練數據的大小"],
        "answer": "B"
    },
    {
        "question": "Orange 3 中哪個小部件用於評估模型性能？",
        "options": ["Data Sampler", "Scatter Plot", "Preprocess", "Test & Score"],
        "answer": "D"
    },
    {
        "question": "貝葉斯優化特別適用於什麼類型的問題？",
        "options": ["簡單計算", "函數評估昂貴的問題", "基本代數問題", "排序算法"],
        "answer": "B"
    },
    {
        "question": "在 Orange 3 中，File 小部件的主要用途是什麼？",
        "options": ["修改數據", "加載數據", "導出數據", "可視化數據"],
        "answer": "B"
    },
    {
        "question": "在 Orange 3 中，使用貝葉斯優化進行超參數調整的替代方法是什麼？",
        "options": ["使用 Box Plot 小部件", "使用 Python Script 小部件與 hyperopt 等庫", "刪除數據預處理步驟", "使用 Confusion Matrix 小部件"],
        "answer": "B"
    },
    {
        "question": "資料擴增（Data Augmentation）技術對於改善何種神經網路的泛化能力非\n常有幫助？",
        "options": ["卷積神經網路（Convolutional Neural Networks）", "循環神經網路（Recurrent Neural Networks）", "長短期記憶網路（Long Short-Term Memory）", "深度信念網路（Deep Belief Networks）"],
        "answer": "A"
    },
    {
        "question": "MNIST 數據集包含多少張手寫數字圖像？",
        "options": ["50000 撘", "60000 撘", "70000 撘", "80000 撘"],
        "answer": "C"
    },
    {
        "question": "MNIST 數據集中的每張圖像為幾乘幾像素的灰度圖？",
        "options": ["26x26", "28x28", "30x30", "32x32"],
        "answer": "B"
    },
    {
        "question": "以下哪一項不是文中提到的資料擴增方法？",
        "options": ["橫向移動", "縱向移動", "旋轉", "鏡像反轉"],
        "answer": "D"
    },
    {
        "question": "橫向移動是指在圖像的哪個方向上進行位移？",
        "options": ["水平方向", "垂直方向", "對角線方向", "隨機方向"],
        "answer": "A"
    },
    {
        "question": "縱向移動類似於橫向移動，但是在哪個方向上進行？",
        "options": ["水平方向", "垂直方向", "對角線方向", "隨機方向"],
        "answer": "B"
    },
    {
        "question": "旋轉是將圖像以何處為軸心進行一定角度的旋轉？",
        "options": ["中心點", "左上角", "右上角", "隨機點"],
        "answer": "A"
    },
    {
        "question": "放大是指改變圖像的尺寸，使圖像看起來更大或更小。在 MNIST 資料集中，\n將圖像放大後需要再裁剪回哪個尺寸？",
        "options": ["26x26 像素", "27x27 像素", "29x29 像素", "28x28 像素"],
        "answer": "D"
    },
    {
        "question": "在示例的 Python 代碼中，使用了哪個函數庫來實現資料擴增？",
        "options": ["NumPy", "TensorFlow/Keras", "PyTorch", "Scikit-learn"],
        "answer": "B"
    },
    {
        "question": "通過資料擴增方法，CNN 可以學習到更豐富的特徵，提高對新樣本的哪種\n能力？",
        "options": ["計算能力", "存儲能力", "識別能力", "推理能力"],
        "answer": "C"
    },
    {
        "question": "哪種優化器結合了 AdaGrad 和 RMSprop 的優點？",
        "options": ["SGD", "Adam", "RMSprop", "Nesterov"],
        "answer": "B"
    },
    {
        "question": "學習率衰減中，哪種衰減方式根據訓練的時間步來調整學習率？",
        "options": ["時序衰減", "步進衰減", "指數衰減", "自適應衰減"],
        "answer": "A"
    },
    {
        "question": "在 Tensorflow Keras 中，SGD 優化器的哪個參數可以加速收斂並跳出局\n部最優？",
        "options": ["learning_rate", "nesterov", "epsilon", "momentum"],
        "answer": "D"
    },
    {
        "question": "RMSprop 優化器特別適合哪種類型的神經網絡？",
        "options": ["卷積神經網路", "對抗生成網絡", "遞歸神經網絡", "全連接網絡"],
        "answer": "C"
    },
    {
        "question": "哪種學習率調整策略當驗證損失沒有改善時會減小學習率？",
        "options": ["ExponentialDecay", "ReduceLROnPlateau", "StepDecay", "TimeDecay"],
        "answer": "B"
    },
    {
        "question": "「warm start」在深度學習中通常指什麼？",
        "options": ["使用預訓練模型作為初始化", "從隨機初始化開始", "使用小批量數據訓練", "測試模型的穩定性"],
        "answer": "A"
    },
    {
        "question": "Adam 優化器中，beta_1 參數主要影響什麼？",
        "options": ["梯度的一階矩", "梯度的二階矩", "學習率的自適應調整", "數值穩定性"],
        "answer": "A"
    },
    {
        "question": "使用循環性學習率（CLR）的主要好處是什麼？",
        "options": ["提高訓練穩定性", "減少對學習率選擇的敏感性", "加速模型收斂", "以上皆是"],
        "answer": "D"
    },
    {
        "question": "在 Adam 優化器中，若要改善收斂性，應該設置哪個參數為 True？",
        "options": ["epsilon", "beta_1", "beta_2", "amsgrad"],
        "answer": "D"
    },
    {
        "question": "「指數衰減」的學習率變化特點是什麼？",
        "options": ["線性衰減", "階梯式衰減", "指數級別衰減", "逆時間衰減"],
        "answer": "C"
    },
    {
        "question": "集成方法的核心思想是什麼?",
        "options": ["單一模型比多個模型更準確", "多個模型比單一模型更不穩定", "多個模型共同決策可以比單一模型更準確和穩定", "模型越多越好"],
        "answer": "C"
    },
    {
        "question": "以下哪一項不是集成方法的運作方式?",
        "options": ["裝袋法", "提升法", "堆疊法", "減枝法"],
        "answer": "D"
    },
    {
        "question": "隨機森林屬於哪一種集成方法?",
        "options": ["裝袋法", "提升法", "堆疊法", "減枝法"],
        "answer": "A"
    },
    {
        "question": "AdaBoost 和梯度提升機屬於哪一種集成方法?",
        "options": ["裝袋法", "提升法", "堆疊法", "減枝法"],
        "answer": "B"
    },
    {
        "question": "堆疊法中的元模型是用來做什麼的?",
        "options": ["生成多個訓練集", "訓練基學習器", "結合基學習器的預測結果", "學習如何最佳地結合基學習器的預測結果"],
        "answer": "D"
    },
    {
        "question": "集成方法可以提高預測準確性的原因是什麼?",
        "options": ["結合了多個模型的優勢", "使用了更多的訓練數據", "使用了更複雜的模型", "訓練時間更長"],
        "answer": "A"
    },
    {
        "question": "集成方法可以減少過擬合的原因是什麼?",
        "options": ["使用了更少的模型", "通過結合多個模型可以有效減少過擬合風險", "使用了更簡單的模型", "訓練時間更短"],
        "answer": "B"
    },
    {
        "question": "集成方法可以提供更加穩定的預測結果的原因是什麼?",
        "options": ["使用了更複雜的模型", "訓練時間更長", "使用了更多的訓練數據", "可以平滑單一模型的預測波動"],
        "answer": "D"
    },
    {
        "question": "以下哪個領域通常不會應用集成方法?",
        "options": ["金融領域", "醫療領域", "體育競技", "圖像識別"],
        "answer": "C"
    },
    {
        "question": "L2 正規化的作用不包括以下哪一項?",
        "options": ["懲罰大權重", "增加模型複雜度", "提高泛化能力", "增強模型的穩定性"],
        "answer": "B"
    },
    {
        "question": "遷移學習的主要目的是什麼?",
        "options": ["創建全新的機器學習模型", "從頭開始訓練模型", "將預訓練模型的知識應用到新任務", "收集更多的訓練數據"],
        "answer": "C"
    },
    {
        "question": "以下哪一種情況不適合使用遷移學習?",
        "options": ["有限的計算資源", "充足的訓練數據", "需要快速開發新應用", "訓練數據不足夠"],
        "answer": "B"
    },
    {
        "question": "遷移學習的一個主要優勢是什麼?",
        "options": ["節省訓練時間和計算資源", "創建更複雜的模型", "收集更多的訓練數據", "提高模型的準確性"],
        "answer": "A"
    },
    {
        "question": "以下哪個領域通常不會應用遷移學習?",
        "options": ["自然語言處理", "圖像識別", "語音識別", "金融風險評估"],
        "answer": "D"
    },
    {
        "question": "遷移學習的'特徵提取'方法是指什麼?",
        "options": ["訓練全新的模型", "從頭開始訓練模型", "使用預訓練模型的中間層作為特徵提取器", "凍結預訓練模型的所有層"],
        "answer": "C"
    },
    {
        "question": "遷移學習的'微調'方法是指什麼?",
        "options": ["訓練全新的模型", "在目標任務的數據集上對預訓練模型進行再訓練", "使用預訓練模型的中間層作為特徵提取器", "凍結預訓練模型的所有層"],
        "answer": "B"
    },
    {
        "question": "遷移學習的'凍結層'方法是指什麼?",
        "options": ["訓練全新的模型", "從頭開始訓練模型", "使用預訓練模型的中間層作為特徵提取器", "將預訓練模型的某些層的參數固定不變"],
        "answer": "D"
    },
    {
        "question": "實踐遷移學習時 通常需要對預訓練模型進行哪些調整?",
        "options": ["調整模型結構和微調模型參數", "從頭開始訓練模型", "收集更多的訓練數據", "創建全新的模型架構"],
        "answer": "A"
    },
    {
        "question": "以下哪一種預訓練模型通常不會用於遷移學習?",
        "options": ["在 ImageNet 上訓練的圖像分類模型", "隨機初始化的模型", "在大型語料庫上訓練的語言模型", "在大型語音數據集上訓練的語音模型"],
        "answer": "B"
    },
    {
        "question": "在遷移學習中 為什麼需要對預訓練模型進行微調?",
        "options": ["減少模型的複雜度", "收集更多的訓練數據", "創建全新的模型架構", "使模型適應目標任務的數據"],
        "answer": "D"
    },
    {
        "question": "以下哪一項不是 RNN 的主要特點?",
        "options": ["能夠處理序列數據", "只能單向傳遞信息", "具有記憶能力", "適用於文字、語音等時序問題"],
        "answer": "B"
    },
    {
        "question": "當前時間步的隱藏狀態 h(t)主要取決於哪些因素?",
        "options": ["上一時間步的輸入 x(t-1)", "上一時間步的輸出 y(t-1)", "上一時間步的隱藏狀態 h(t-1)", "當前時間步的激活函數"],
        "answer": "C"
    },
    {
        "question": "以下哪一個不是 LSTM 的主要組成部分?",
        "options": ["遺忘閘", "循環單元", "輸入閘", "輸出閘"],
        "answer": "B"
    },
    {
        "question": "遺忘閘的主要作用是什麼?",
        "options": ["決定細胞狀態中哪些信息需要被遺忘或保留", "決定需要加入多少新信息", "決定隱藏狀態的輸出", "控制模型的訓練過程"],
        "answer": "A"
    },
    {
        "question": "輸入閘在 LSTM 中的作用是什麼?",
        "options": ["控制遺忘細胞狀態中哪些信息", "決定需要加入多少新信息到細胞狀態中", "控制隱藏狀態的輸出", "影響模型的訓練過程"],
        "answer": "B"
    },
    {
        "question": "CEC 單元主要是用來解決哪個問題?",
        "options": ["梯度消失問題", "梯度爆炸問題", "數據不平衡問題", "過度擬合問題"],
        "answer": "A"
    },
    {
        "question": "以下哪一項不是 GRU 的主要組成部分?",
        "options": ["重置門", "更新門", "候選隱藏狀態", "遺忘閘"],
        "answer": "D"
    },
    {
        "question": "輸出權重衝突的主要原因是什麼?",
        "options": ["梯度消失問題", "訓練數據不足", "同一權重用於不同作用", "模型結構不合適"],
        "answer": "C"
    },
    {
        "question": "在 RNN 中，Wx 代表什麼?",
        "options": ["輸入到隱藏層的權重矩陣", "隱藏層到輸出層的權重矩陣", "前一時間步到當前時間步的權重矩陣", "隱藏層到隱藏層的權重矩陣"],
        "answer": "A"
    },
    {
        "question": "以下哪一項不是 LSTM 的計算公式涉及的運算符號?",
        "options": ["逐元素相乘(x)", "逐元素相加(+)", "Sigmoid 激活函數(σ)", "ReLU 激活函數"],
        "answer": "D"
    },
    {
        "question": "自然語言處理（NLP）包括哪些部分？",
        "options": ["認知、理解、生成", "輸入、處理、輸出", "理解、生成、預測", "學習、記憶、應用"],
        "answer": "A"
    },
    {
        "question": "在自然語言處理中，哪個步驟是將句子、段落分解為單詞？",
        "options": ["詞性標註", "斷詞", "詞幹提取", "命名實體識別"],
        "answer": "B"
    },
    {
        "question": "下列哪一項屬於自然語言處理的挑戰和困難？",
        "options": ["單詞的邊界界定", "語法規則的簡單化", "數據的無效性", "語言的多樣性"],
        "answer": "A"
    },
    {
        "question": "在自然語言處理的演進中，1980 年代的主要技術是什麼？",
        "options": ["神經網路", "規則基礎系統", "機器學習", "深度學習"],
        "answer": "C"
    },
    {
        "question": "下列哪一個應用屬於自然語言處理的範疇？",
        "options": ["電子商務", "數據分析", "雲端計算", "聊天機器人"],
        "answer": "D"
    },
    {
        "question": "Ridge 回歸的目的是解決普通最小二乘回歸在處理哪個問題時的缺點?",
        "options": ["異常值敏感", "多重共線性", "假設限制", "以上皆非"],
        "answer": "B"
    },
    {
        "question": "Ridge 回歸的損失函數中添加了哪一項來解決多重共線性問題?",
        "options": ["L1 正則化項", "L0 正則化項", "L2 正則化項", "以上皆非"],
        "answer": "C"
    },
    {
        "question": "當 Ridge 回歸的正則化參數 α 等於 0 時，它退化為何種回歸方法?",
        "options": ["普通最小二乘回歸", "邏輯回歸", "脊迴歸", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "RidgeCV 是 Ridge 回歸的變體，它自動選擇什麼參數?",
        "options": ["L1 正則化參數", "L0 正則化參數", "L2 正則化參數", "最佳的正則化參數 α"],
        "answer": "D"
    },
    {
        "question": "RidgeCV 使用什麼方法來選擇最佳的正則化參數 α?",
        "options": ["梯度下降", "交叉驗證", "隨機搜索", "網格搜索"],
        "answer": "B"
    },
    {
        "question": "最小二乘回歸（OLS）的目標是建立一個什麼模型來描述自變量和應變量之間的關係?",
        "options": ["非線性模型", "指數模型", "線性模型", "對數模型"],
        "answer": "C"
    },
    {
        "question": "最小二乘估計法的核心思想是通過最小化什麼來估計回歸係數 β?",
        "options": ["觀測值與模型預測值之間的平方誤差", "觀測值與模型預測值之間的絕對誤差", "觀測值與模型預測值之間的誤差", "以上皆非"],
        "answer": "A"
    },
    {
        "question": "在最小二乘回歸的假設中，誤差項 ϵ 應該服從什麼分佈?",
        "options": ["均勻分佈", "指數分佈", "泊松分佈", "均值為零的正態分佈"],
        "answer": "D"
    },
    {
        "question": "最小二乘回歸的優點不包括以下哪一項?",
        "options": ["簡單易懂", "對異常值不敏感", "無偏性", "一致性"],
        "answer": "B"
    },
    {
        "question": "當自變量之間存在強共線性時，OLS 估計量會出現什麼問題?",
        "options": ["估計值偏差很大", "估計值與真實值無關", "估計值的方差會很大，導致不穩定", "以上皆非"],
        "answer": "C"
    }    
];


let currentQuestionIndex = 0;
let answers = [];
let currentPage = 0;
const questionsPerPage = 10; // 每頁顯示的題目數量
let currentResultPage = 0;
let incorrectQuestions = []; // 將其定義為全局變量

document.getElementById("startQuiz").addEventListener("click", startQuiz);
document.getElementById("submitQuiz").addEventListener("click", submitQuiz);
document.getElementById("prevQuestion").addEventListener("click", () => changeQuestion(-1));
document.getElementById("nextQuestion").addEventListener("click", () => changeQuestion(1));
document.getElementById("reviewQuiz").addEventListener("click", () => {
    document.getElementById("quizContainer").style.display = "block";
    document.getElementById("resultContainer").style.display = "none";
    document.getElementById("overviewContainer").style.display = "none";
});
document.getElementById("browseQuiz").addEventListener("click", browseQuiz);
document.getElementById("prevPage").addEventListener("click", () => changePage(-1));
document.getElementById("nextPage").addEventListener("click", () => changePage(1));
document.getElementById("prevResultPage").addEventListener("click", () => changeResultPage(-1));
document.getElementById("nextResultPage").addEventListener("click", () => changeResultPage(1));

function startQuiz() {
    const numQuestions = parseInt(document.getElementById("numQuestions").value, 10);
    
    // 檢查題目數量是否有效
    if (isNaN(numQuestions) || numQuestions < 1 || numQuestions > questions.length) {
        alert(`請輸入有效的題目數量！（1 - ${questions.length} 之間）`);
        return;
    }

    answers = [];  // 重置答案数组
    const selectedQuestions = getRandomQuestions(numQuestions);
    questions.splice(0, questions.length, ...selectedQuestions);  // 更新问题数组
    currentQuestionIndex = 0;
    displayQuestion(currentQuestionIndex);
    document.getElementById("quizContainer").style.display = "block";
    document.getElementById("resultContainer").style.display = "none";
    document.getElementById("overviewContainer").style.display = "none"; // 隱藏閱覽區域
}

function displayQuestion(index) {
    const question = questions[index];
    const questionContainer = document.getElementById("questionContainer");
    questionContainer.innerHTML = `
        <p>${index + 1}. ${question.question}</p>
        ${question.options.map((option, i) => `
            <label><input type="radio" name="question${index}" value="${i}" ${answers[index] === i ? 'checked' : ''}> ${option}</label>
        `).join('')}
    `;
    document.getElementById("prevQuestion").style.display = index === 0 ? 'none' : 'inline';
    document.getElementById("nextQuestion").style.display = index === questions.length - 1 ? 'none' : 'inline';
}

function changeQuestion(delta) {
    saveAnswer();
    currentQuestionIndex += delta;
    displayQuestion(currentQuestionIndex);
}

function saveAnswer() {
    const selectedOption = document.querySelector(`input[name="question${currentQuestionIndex}"]:checked`);
    answers[currentQuestionIndex] = selectedOption ? parseInt(selectedOption.value) : undefined;
}

function submitQuiz() {
    saveAnswer();
    let correctCount = 0;
    incorrectQuestions = []; // 重置錯誤題目數組

    questions.forEach((q, index) => {
        const correctIndex = q.answer.charCodeAt(0) - 65; // 將字母答案轉為索引
        if (answers[index] === correctIndex) {
            correctCount++;
        } else {
            const userChoice = answers[index] !== undefined ? q.options[answers[index]] : "未作答";
            const correctAnswer = q.options[correctIndex];
            incorrectQuestions.push(`第 ${index + 1} 題: ${q.question}<br>你的答案 - ${userChoice}, 正確答案 - ${correctAnswer}<br><br>`);
        }
    });

    document.getElementById("correctAnswers").textContent = `正確題數: ${correctCount}`;
    renderIncorrectQuestions();
    document.getElementById("resultContainer").style.display = "block";
    document.getElementById("quizContainer").style.display = "none";
    document.getElementById("overviewContainer").style.display = "none"; // 隱藏閱覽區域
}

function renderIncorrectQuestions() {
    currentResultPage = 0;
    updateResultOverview();
}

function updateResultOverview() {
    const incorrectAnswersContainer = document.getElementById("incorrectAnswers");
    incorrectAnswersContainer.innerHTML = ''; // 清空现有内容
    incorrectAnswersContainer.style.textAlign = "left"; // 确保靠左对齐

    const start = currentResultPage * questionsPerPage;
    const end = Math.min(start + questionsPerPage, incorrectQuestions.length);

    for (let i = start; i < end; i++) {
        const questionElement = document.createElement("div");
        questionElement.innerHTML = `<p>${incorrectQuestions[i]}</p>`;
        incorrectAnswersContainer.appendChild(questionElement);
    }

    document.getElementById("prevResultPage").style.display = currentResultPage === 0 ? 'none' : 'inline';
    document.getElementById("nextResultPage").style.display = end === incorrectQuestions.length ? 'none' : 'inline';
}

function changeResultPage(delta) {
    currentResultPage += delta;
    updateResultOverview();
}

function getRandomQuestions(num) {
    const shuffled = questions.sort(() => 0.5 - Math.random());
    return shuffled.slice(0, num);
}

function browseQuiz() {
    currentPage = 0; // 重置为第一页
    updateOverview();
    document.getElementById("quizContainer").style.display = "none";
    document.getElementById("resultContainer").style.display = "none"; // 隱藏結果區域
    document.getElementById("overviewContainer").style.display = "block";
}

function updateOverview() {
    const questionsOverview = document.getElementById("questionsOverview");
    questionsOverview.innerHTML = ''; // 清空现有内容
    questionsOverview.style.textAlign = "left"; // 确保靠左对齐

    const start = currentPage * questionsPerPage;
    const end = Math.min(start + questionsPerPage, questions.length);

    for (let i = start; i < end; i++) {
        const question = questions[i];
        const answered = answers[i] !== undefined;
        const statusText = answered ? "已答" : "未作答";
        const questionElement = document.createElement("div");
        questionElement.innerHTML = `<p class="${answered ? '' : 'unanswered'}">${i + 1}. ${question.question} (${statusText})</p>`;
        questionElement.onclick = () => jumpToQuestion(i);
        questionsOverview.appendChild(questionElement);
    }

    document.getElementById("prevPage").style.display = currentPage === 0 ? 'none' : 'inline';
    document.getElementById("nextPage").style.display = end === questions.length ? 'none' : 'inline';
}

function changePage(delta) {
    currentPage += delta;
    updateOverview();
}

function jumpToQuestion(index) {
    currentQuestionIndex = index;
    displayQuestion(currentQuestionIndex);
    document.getElementById("overviewContainer").style.display = "none";
    document.getElementById("quizContainer").style.display = "block";
}